app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "category", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "tomate"], ["description", "legume"], ["category", "alimento"], ["value", 2.3], ["created_at", "2019-11-14 17:31:58.643510"], ["updated_at", "2019-11-14 17:31:58.643510"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save